app/controllers/articles_controller.rb

  def base_editor_assigments
    @user = current_user
    @version = @user.editor_version if @user
    @organizations = @user&.organizations
    @tag = Tag.find_by(name: params[:template])
---
SELECT "tags".* FROM "tags" WHERE "tags"."name" IS NULL LIMIT $1  [["LIMIT", 1]]