app/models/article.rb

SELECT "collections"."slug" FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 1]]
---
  def all_series
    # all series names
    user&.collections&.pluck(:slug)